Revit 2027 API
BuiltInFailures.CreationFailures.CannotDrawRoof Property
 Can't make roof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDrawRoof { get; }
Public Shared ReadOnly Property CannotDrawRoof As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDrawRoof {
	FailureDefinitionId^ get ();
}
static member CannotDrawRoof : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace